# GetNormalAtVerticalProjectionPoint Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Floor..::..GetNormalAtVerticalProjectionPoint Method
Floor Class See Also
---
Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ GetNormalAtVerticalProjectionPoint(
	XYZ modelLocation,
	FloorFace floorFace
)
```

Visual Basic
---
```text
Public Function GetNormalAtVerticalProjectionPoint ( _
	modelLocation As XYZ, _
	floorFace As FloorFace _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetNormalAtVerticalProjectionPoint(
	XYZ^ modelLocation,
	FloorFace floorFace
)
```

# ### Parameters
modelLocation
    Type: Autodesk.Revit.DB..::..XYZ A point in project coordinates whose vertical projection will determine the location at which the normal will be taken.
floorFace
    Type: Autodesk.Revit.DB..::..FloorFace A flag determining whether the top or bottom face of the floor should be used.
# ### Return Value
Normal vector on the slab at the projection point.
# Remarks
If the floor is shape edited, the floor location at which we attempt to take the normal must be within the boundaries of a face on the slab. Otherwise the method will return nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
Floor Class
Autodesk.Revit.DB Namespace